### 📖 Terraform Plan (infra/modules/azure_core_infra/example/complete) - success
<details>
<summary>Show Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.core.azurerm_resource_group.common will be created
  + resource "azurerm_resource_group" "common" {
      + id       = (known after apply)
      + location = "italynorth"
      + name     = "dx-d-itn-common-rg-01"
      + tags     = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
    }

  # module.core.azurerm_resource_group.gh_runner will be created
  + resource "azurerm_resource_group" "gh_runner" {
      + id       = (known after apply)
      + location = "italynorth"
      + name     = "dx-d-itn-github-runner-rg-01"
      + tags     = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
    }

  # module.core.azurerm_resource_group.network will be created
  + resource "azurerm_resource_group" "network" {
      + id       = (known after apply)
      + location = "italynorth"
      + name     = "dx-d-itn-network-rg-01"
      + tags     = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
    }

  # module.core.azurerm_resource_group.test[0] will be created
  + resource "azurerm_resource_group" "test" {
      + id       = (known after apply)
      + location = "italynorth"
      + name     = "dx-d-itn-test-rg-01"
      + tags     = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
    }

  # module.core.module.common_log_analytics.azurerm_log_analytics_workspace.this will be created
  + resource "azurerm_log_analytics_workspace" "this" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "italynorth"
      + name                            = "dx-d-itn-common-log-01"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "dx-d-itn-common-rg-01"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + workspace_id                    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["azure_api_net"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "azure-api.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["azurewebsites"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.azurewebsites.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["blob"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.blob.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["container_app"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.italynorth.azurecontainerapps.io"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["documents"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.documents.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["file"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.file.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["management_azure_api_net"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "management.azure-api.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["psql"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.postgres.database.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["queue"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.queue.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["redis"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.redis.cache.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["scm_azure_api_net"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "scm.azure-api.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["servicebus"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.servicebus.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["srch"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.search.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["table"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.table.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["vault"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.vaultcore.azure.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["azure_api_net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "azure-api.net"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["azurewebsites"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.azurewebsites.net"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["blob"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.blob.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["container_app"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.italynorth.azurecontainerapps.io"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["documents"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.documents.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["file"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.file.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["management_azure_api_net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "management.azure-api.net"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["psql"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.postgres.database.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["queue"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.queue.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["redis"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.redis.cache.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["scm_azure_api_net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "scm.azure-api.net"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["servicebus"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.servicebus.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["srch"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.search.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["table"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.table.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["vault"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.github_runner.azurerm_container_app_environment.cae will be created
  + resource "azurerm_container_app_environment" "cae" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + infrastructure_subnet_id         = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "italynorth"
      + log_analytics_workspace_id       = (known after apply)
      + logs_destination                 = (known after apply)
      + mutual_tls_enabled               = false
      + name                             = "dx-d-itn-github-runner-cae-01"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "dx-d-itn-github-runner-rg-01"
      + static_ip_address                = (known after apply)
      + tags                             = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + zone_redundancy_enabled          = false
    }

  # module.core.module.github_runner.azurerm_management_lock.lock_cae will be created
  + resource "azurerm_management_lock" "lock_cae" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "dx-d-itn-github-runner-cae-01"
      + notes      = "This Container App Environment cannot be deleted"
      + scope      = (known after apply)
    }

  # module.core.module.github_runner.azurerm_subnet.runner_snet will be created
  + resource "azurerm_subnet" "runner_snet" {
      + address_prefixes                              = [
          + "10.0.242.0/23",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "dx-d-itn-github-runner-snet-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "dx-d-itn-network-rg-01"
      + virtual_network_name                          = "dx-d-itn-common-vnet-01"
    }

  # module.core.module.key_vault.azurerm_key_vault.common will be created
  + resource "azurerm_key_vault" "common" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "italynorth"
      + name                          = "dx-d-itn-common-kv-01"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "dx-d-itn-common-rg-01"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + tenant_id                     = "7788edaf-0346-4068-9d79-c868aed15b3d"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.core.module.key_vault.azurerm_private_endpoint.vault will be created
  + resource "azurerm_private_endpoint" "vault" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "dx-d-itn-modules-test-kv-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dx-d-itn-network-rg-01"
      + subnet_id                = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dx-d-itn-modules-test-kv-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # module.core.module.network.azurerm_subnet.pep_snet will be created
  + resource "azurerm_subnet" "pep_snet" {
      + address_prefixes                              = [
          + "10.50.2.0/23",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "dx-d-itn-pep-snet-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "dx-d-itn-network-rg-01"
      + virtual_network_name                          = "dx-d-itn-common-vnet-01"
    }

  # module.core.module.network.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space                  = [
          + "10.50.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "italynorth"
      + name                           = "dx-d-itn-common-vnet-01"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "dx-d-itn-network-rg-01"
      + subnet                         = (known after apply)
      + tags                           = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
    }

  # module.core.module.vpn[0].azurerm_subnet.dns_forwarder_snet will be created
  + resource "azurerm_subnet" "dns_forwarder_snet" {
      + address_prefixes                              = [
          + "10.50.252.8/29",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "dx-d-itn-dns-forwarder-snet-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "dx-d-itn-network-rg-01"
      + virtual_network_name                          = "dx-d-itn-common-vnet-01"

      + delegation {
          + name = "delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.ContainerInstance/containerGroups"
            }
        }
    }

  # module.core.module.vpn[0].azurerm_subnet.vpn_snet will be created
  + resource "azurerm_subnet" "vpn_snet" {
      + address_prefixes                              = [
          + "10.50.133.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "GatewaySubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "dx-d-itn-network-rg-01"
      + virtual_network_name                          = "dx-d-itn-common-vnet-01"
    }

  # module.core.module.vpn[0].module.dns_forwarder.azurerm_container_group.this will be created
  + resource "azurerm_container_group" "this" {
      + dns_name_label_reuse_policy = "Unsecure"
      + exposed_port                = (known after apply)
      + fqdn                        = (known after apply)
      + id                          = (known after apply)
      + ip_address                  = (known after apply)
      + ip_address_type             = "Private"
      + location                    = "italynorth"
      + name                        = "dx-d-itn-dns-forwarder-ci-01"
      + network_profile_id          = (known after apply)
      + os_type                     = "Linux"
      + resource_group_name         = "dx-d-itn-network-rg-01"
      + restart_policy              = "Always"
      + sku                         = "Standard"
      + subnet_ids                  = (known after apply)
      + tags                        = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }

      + container {
          + commands = [
              + "/coredns",
              + "-conf",
              + "/app/conf/Corefile",
            ]
          + cpu      = 0.5
          + image    = "coredns/coredns:1.10.1@sha256:be7652ce0b43b1339f3d14d9b14af9f588578011092c1f7893bd55432d83a378"
          + memory   = 0.5
          + name     = "dns-forwarder"

          + ports {
              + port     = 53
              + protocol = "UDP"
            }

          + volume {
              + empty_dir  = false
              + mount_path = "/app/conf"
              + name       = "dns-forwarder-conf"
              + read_only  = true
              + secret     = (sensitive value)
            }
        }
    }

  # module.core.module.vpn[0].module.dns_forwarder.null_resource.secret_trigger will be created
  + resource "null_resource" "secret_trigger" {
      + id       = (known after apply)
      + triggers = {
          + "trigger" = "Ljo1MyB7CiAgICBlcnJvcnMKICAgIHJlYWR5CiAgICBoZWFsdGgKICAgIGZvcndhcmQgLiAxNjguNjMuMTI5LjE2CiAgICBjYWNoZSAzMAogICAgbG9vcAogICAgcmVsb2FkCn0K"
        }
    }

  # module.core.module.vpn[0].module.vpn.azurerm_public_ip.gw[0] will be created
  + resource "azurerm_public_ip" "gw" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + domain_name_label       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "italynorth"
      + name                    = "dx-d-itn-vgw-01-gw-pip"
      + resource_group_name     = "dx-d-itn-network-rg-01"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
    }

  # module.core.module.vpn[0].module.vpn.azurerm_virtual_network_gateway.gw will be created
  + resource "azurerm_virtual_network_gateway" "gw" {
      + active_active                         = false
      + bgp_route_translation_for_nat_enabled = false
      + enable_bgp                            = false
      + generation                            = (known after apply)
      + id                                    = (known after apply)
      + ip_sec_replay_protection_enabled      = true
      + location                              = "italynorth"
      + name                                  = "dx-d-itn-vgw-01-gw"
      + remote_vnet_traffic_enabled           = false
      + resource_group_name                   = "dx-d-itn-network-rg-01"
      + sku                                   = "VpnGw1"
      + tags                                  = {
          + "CostCenter"    = "TS700 - ENGINEERING"
          + "CreatedBy"     = "Terraform"
          + "Environment"   = "Dev"
          + "ModuleName"    = "azure_core_infra"
          + "ModuleSource"  = "DX"
          + "ModuleVersion" = "1.0.9"
          + "Owner"         = "DevEx"
          + "Source"        = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/complete"
        }
      + type                                  = "Vpn"
      + virtual_wan_traffic_enabled           = false
      + vpn_type                              = "RouteBased"

      + bgp_settings (known after apply)

      + ip_configuration {
          + name                          = "dx-d-itn-vgw-01-gw-config"
          + private_ip_address_allocation = "Dynamic"
          + public_ip_address_id          = (known after apply)
          + subnet_id                     = (known after apply)
        }

      + vpn_client_configuration {
          + aad_audience         = "854cef16-360b-4751-9206-21b958321a83"
          + aad_issuer           = "https://sts.windows.net/7788edaf-0346-4068-9d79-c868aed15b3d/"
          + aad_tenant           = "https://login.microsoftonline.com/7788edaf-0346-4068-9d79-c868aed15b3d"
          + address_space        = [
              + "172.16.2.0/24",
            ]
          + vpn_auth_types       = (known after apply)
          + vpn_client_protocols = [
              + "OpenVPN",
            ]
        }
    }

  # module.core.module.vpn[0].module.vpn.random_string.dns will be created
  + resource "random_string" "dns" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 49 to add, 0 to change, 0 to destroy.


</details>
